Staok/stm32_framework/STM32F1_HAL_freeRTOS_Framework/SYSTEM/sys_config.h
#ifndef __SYS_CONFIG_H
#define __SYS_CONFIG_H

#include "sysVar.h"								/*定义系统级常用的变量、数据类型和二进制表示宏*/
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"						/*在里面的stm32f1xx_hal_conf.h里面选择用哪些外设的HAL库——————！按需要进行修改！*/
//#include "FIFO.h"								
												/*用Github上面的一个开源仓库，
												一个实现对任何形式数据的环形缓存，默认已经用于串口接收，参考程序看.h文件内
												开源仓库地址：https://github.com/geekfactory/FIFO.git*/
												
												
#include "malloc.h"								/*借鉴正点原子的 内存管理 章节的源代码自实现的malloc和free*/				
												
												
												
/*用户设备驱动和APP文件调用*/
#include "TFTLCD.h"
												
												

/*
编程和应用规范：
	No.1：紧凑，通用，可迭代，高内聚低耦合，广泛借鉴
	No.2: 尽量减少数据传输过程中的拷贝，常用指针、结构体指针当传输数据，函数形参带const修饰符
	No.3: 一类或者一个模块内的变量尽量用结构体打包，多组数据就用结构体数组
		  函数返回值0表示成功，正数表示失败，此正数可以表示错误代码
		  IO尽量设计为低电平有效，高电平截止；按键IO尽量都使用外部中断
		  大块内存使用请用本模板内存管理相关API
		  
		  外设相关的所有API均在：
				#include "sys.h"
				里面，APP编写时按需要在.c文件内调用这个即可
		独立IO口相关的所有API均在：
				#include "PeriphConfig.h"
				里面，APP编写时按需要在.c文件内调用这个即可

*/

/*
命名规范：（临时）
	0、函数命名规则为“属什么是什么做什么”，如：sys_irq_disable()，属于sys级别函数，是irq管理，做dsiable的功能
	1、系统使用外设功能的启用与否均用宏定义SYSTEM_SUPPORT_XX
	2、RTOS任务函数均使用xx_task()命名
	3、任务函数与任务名称一致，任务索引与函数一致，只是task部分简写为t
	4、函数注释规范如下：*/
	
	/*__________函数简述_____________*/
	/********************************
	*描述：函数详细描述——————！按需要进行修改！
	*参数：		1、...
				2、...
	*返回值：	1、NULL
	********************************/
	
	/*
	5、
	6、
	7、MCU外设统称"外设"，即Periph，用户的MCU外围芯片和设备统称"器件"或"设备",即devices
	*/
	
/*本模板默认和规范的事项：（临时，待整理）
	00、工程内现已经不含string、stdio和stdlib等不适合用于mcu平台的头文件，已经都用开源的线程安全软件或者自实现替换
		（对于FreeRTOS包含stdlib库、stdio库和string库，没办法）
	0、中断优先级分组选用分组4，即16级抢占优先级，0级响应优先级（即不用）
	1、IO的低电平为有效电平，高电平截止或者无效；按键IO尽量都使用外部中断
	2、使用C99模式编译！
	3、I2C使用软件实现
	4、FreeRTOS所有组件始终使用动态申请内存；FreeRTOS的配置文件除了用户按需更改区域，尽量不要动；一般不使用软件定时器，用硬件定时器或者周期延时替代即可
	
	5、定时器4默认用于提供模板心跳的10ms时基，必须开启并且不可更改
	6、定时器3默认用于产生PWM，默认开启通道4用于无源报警蜂鸣器，必须开启，但可以更改参数；并且可选开启定时中断，提供一个同步功能
	6、定时器2是多功能的，可选用于定时中断、PWM、输入捕获和正交解码（编码器解码），是否启用和参数用户可自行更改
	6、定时器5本模板没有提供选项，用户可按照需求自己灵活编写驱动代码
	7、定时器6、7仅提供是否开启选项，只能用于定时中断，提供更多的同步功能
	7、定时器1、8是高级定时器，专门用于产生PWM，定时器1支持1~3通道互补PWM输出和4通道PWM输出，有刹车功能，是否启用和参数用户可自行更改
	
	7、外设如串口、PWM等的IO初始化在其初始化函数内，不用单独再初始化
	8、函数返回值：0表正确，正数表错误并带返回信息，并尽量用HAL类型返回值如：
		  HAL_OK       = 0x00U,
		  HAL_ERROR    = 0x01U,
		  HAL_BUSY     = 0x02U,
		  HAL_TIMEOUT  = 0x03U
	9、FSMC的块1的区3和区4分别留给外部RAM和LCD，本模板默认的，慎改
	10、把本模板各种外设中默认的东西都罗列在这里
		
*/

/*坑说明：
	1、由于历史遗留原因，本MDK工程编码位GB2312，所以用外部文件写程序时请选用GB2312编码来写
		但是如果已经使用UTF-8等编码编写了很多内容时，只需用notepad软件新建一个新文件，选择GB2312编码，然后复制原来UTF-8等编码格式的原文进来，就自动转为GB2312编码了
		或者应win自带的文本文件保存格式选择GB2312即可
		不过推荐以后都按照UTF-8格式！
*/

/*
STM32F10xx系列命名规范：

STM32F
	  101 = 		基本型
	  102 = 		USB基本型， USB 2.0全速设备
	  103 = 		增强型
	  105或107 = 	互联型
			  T = 36脚
			  C = 48脚
			  R = 64脚
			  V = 100脚
			  Z = 144脚
			  I = 176脚
			   4 = 16KB(ld)
			   6 = 32KB(ld)
			   8 = 64KB(md)
			   B = 128KB(md)
			   C = 256KB(hd)
			   D = 384KB(hd)
			   E = 512KB(hd)
			   G = 1024KB(hd)
			    H = BGA封装
				T = LQFP封装
				 6 = -40~85℃
			FLASH               RAM
			
			16K(ld)				6K			ld:2个USART，3个16位定时器+1个16位电机控制定时器，1个SPI，1个I2C，USB，CAN，1个高级定时器，2个ADC，DMA1（7通道）
			32K(ld)				10K
			
			64K(md)				20K			md:3个USART，4个16位定时器+1个16位电机控制定时器，2个SPI，2个I2C，USB，CAN，1个高级定时器，2个ADC（通道数不定）
			128K(md)			20K						(x8/xB系列有1、2、3、4定时器)，DMA1（7通道）
			
			256K(hd)			48K或64K	hd:3+2个串口，8个以上16位定时器+2个以上16位电机控制定时器，2个基本定时器，3个SPI，2个I2S，2个I2C，USB，CAN，
			384K(hd)			64K				2个高级定时器，3个ADC（通道数不定），2个12bit DAC，1个SDIO，FSMC(100和144脚封装)，DMA1（7通道）、2（5通道）
			512K(hd)			64K
*/

/*
启动：	BOOT1	BOOT0		启动区域
		  x		  0			FLASH
		  0		  1			系统储存器(ISP下载)
		  1		  1			SRAM
*/

/*
需要 256K(hd) 及以上IC的外设列表：
	SDIO
	DAC
	FSMC
	DMA2
	TIM6\7\8
	
	在STM32F103系列之间切换容量或者芯片时，需要配置以下几项：
	1、在 Device 里改芯片型号
	2、在 C/C++ 里面改 Symbols 到相应芯片型号，可选：
		STM32F103x6 —— STM32F103xB —— STM32F103xE ——  STM32F103xG 
	3、（第一步完成后这里就自动改了，再检查一下）在 Debug 里面的 下载Settings 里面的 Flash Download 里面改相应的小、中大容量下载算法
	4、在当前工程的CORE文件夹里 只保留 相应的startup.s文件，对于中容量为startup_stm32f103xb.s，以此类推
*/
/*
增加把程序下载到SRAM调试的功能：
	前情说明：
		BOOT设置的效果：
			BOOT1	BOOT0		启动区域
			x		  0			FLASH 		复位从FLASH运行，Target为'SRAM'时，按"下载"后，复位启动还是FLASH，
																			   按MCU的复位按键还是从FLASH运行
																			   只有按"调试"后，才会从MCU的内部SRAM运行
																				但是还得按下"顺序执行"才会跑起来
			1		  1			SRAM		复位从SRAM运行，Target为'SRAM'时，按"下载"后，从内部SRAM运行，
																			  按MCU的复位按键从内部SRAM运行
																			  按"调试"后，从内部SRAM运行
																				但是还得按下"顺序执行"才会跑起来
			结论：如果下载验证的频次很高，推荐还是改一下BOOT0和1为1为好
		计算把MCU的内部SRAM分给程序空间和数据空间的大小：
			可用把MCU内部的SRAM对半分，也可以任意定；
			如MCU的内部SRAM有128KB，一半的大小 1024*128/2，其16进制为 0x10000
	
	配置过程：（下面都以128KB的SRAM对半分给程序空间和数据空间为例子）
		1、Project Targets 里面增加一个 'SRAM' 选项
		2、Select Target 选择 'SRAM' 选项，让工程切换到此配置的环境中
		3、打开 Options for Target：
			在 Target栏 填入 	IROM1：0x20000000（八位）			0x10000（分64KB给程序空间）
								IRAM1：0x20010000（IROM1 + 其size）	0x10000（分64KB给数据空间）
			在 C/C++栏 的	Define 里面添加 VECT_TAB_SRAM 宏
			在 Debug栏 	勾选 "Load Application at startup"
						创建一个 "Dbg_RAM.ini" 文件，放在工程文件的同目录里
						在 Initialization File栏添加 ".\Dbg_RAM.ini"，
							这个文件的具体内容在最后附上
			在 Debug栏	进入Settings 
									在 Debug栏 的右下角的 Download Options的两个都选上
									在Flash Download栏  选择 "Do not Erase"，
														在RAM for Algorithm 里面保持与上面的 IRAM1 的一致
														在Programming Algorithm 里面的
															右下角的两个框框保持与上面的 IROM1 的一致
		4、Over!				
	
	Dbg_RAM.ini内容：					
		FUNC void Setup (void) {
		  SP = _RDWORD(0x20000000);             // Setup Stack Pointer
		  PC = _RDWORD(0x20000004);             // Setup Program Counter
		  XPSR = 0x01000000;                    // Set Thumb bit
		  _WDWORD(0xE000ED08, 0x20000000);      // Setup Vector Table Offset Register
		}

		FUNC void OnResetExec (void) {
			Setup();
		}

		LOAD .\Objects\STM32F4DSP_HAL_freeRTOS_Framework.axf INCREMENTAL	// 这个是 OBJ里 axf文件的路径，用户要改，其他莫动~

		Setup();

		g, main
*/

/*________________________________________DSP使用_________________________________________*/
/*	ARM	CMSIS 5.7.0 DSP Lib
P.S：	每个版本的 Cube 软件包都会携带 CMSIS 文件夹，只是版本比较老，不推荐
P.SS：	不使用MDK的math.h库，只使用arm_math.h的库，即ARM的数学库，从F0到F4等都有
添加：
	1 添加文件：
		库版本：Files 加入DSP_LIB\arm_cortexM4lf_math.lib（浮点 Cortex-M4 小端模式），Include Paths 加入DSP_LIB\Inc
		源文件版本：解压 ..\DSP_LIB\src下的.zip文件，添加每个文件夹中的主要.c文件（不用都添加），Include Paths 加入DSP_LIB\Inc
	2 添加必要宏定义在Define：ARM_MATH_CM4,__CC_ARM（PS,在CMSIS\DSP下的编译生成.lib的MDK工程中，看见已经定义了宏：
	ARM_MATH_MATRIX_CHECK, ARM_MATH_ROUNDING, ARM_MATH_LOOPUNROLL，所以我猜这里就不用再添加了，猜的，TODO：需要试验）
	3 编译
注意：（重要）
	在计算表达式中，强制常量为单精度浮点数，以避免引入双精度浮点数动算，即所有常数浮点数后面加f
	不要使用math.h里面的函数，要使用arm_math.h的API
	大量数据可以用malloc放在CCM RAM里面
	尽量用乘法代替除法，尽量减少除法
	找出算法中的重复计算，将其合并，只计算一次
	对于复杂的计算，考虑是否能用查表来代替，在存储空间不是很紧张的情况下
	选择优化等级-O3
	常规乘法加法或单精度浮点的算式尽量直接写；特殊计算如三角函数、开方或者矩阵运算、FFT等就要用DSP函数了！
		用最高层的API，不要用底层的乘、加等API自己实现计算过程，这样反而更慢（意思同上一条）
		测试了arm_sqrt_f32、三角函数，这些都要比math.h库快10倍左右！
	
