Staok/stm32_framework/STM32F1_HAL_freeRTOS_Framework/SYSTEM/sys_config.h
		启动互补通道1~3的PWM输出
		HAL_TIMEx_PWMN_Start(&TIM1_Handler,TIM_CHANNEL_1);
		
		关闭通道的PWM输出（通道选择同上）
		HAL_TIM_PWM_Stop(&TIM1_Handler,TIM_CHANNEL_1);
		HAL_TIMEx_PWMN_Stop(&TIM1_Handler,TIM_CHANNEL_1);
		
		设置TIM1的PWM通道2的占空比百分数为88.8%，值需在0~100.0之间。即88.8%的低电平时间（本模板规范：低电平有效，即用电器工作电压）
		TIM1_set_Channel_Pulse(TIM1PWM_Channel_2,88.8);
*/

/*hd系列外设，其他与上同理*/
/*高级定时器8，专门用于产生PWM信号：三路互补PWM输出、死区控制、刹车信号输入*/
/*引脚：
				CH1/CH1N		CH2/CH2N		CH3/CH3N		CH4		BKIN（刹车信号输入）
				PC6/PA7			PC7/PB0			PC8/PB1			PC9		PA6
*/
/*默认并推荐不开启定时中断；引脚默认没有上下拉；初始化后默认没有打开相应通道的PWM输出，需要手动开启输出*/
/*定时器工作在向上计数时，PWM信号边缘对齐；定时器工作在向上和向下计数模式时，PWM信号中心对齐*/
/*没有重映射功能*/
#define STSTEM_TIM8PWM_ENABLE		0				/*是否启用并初始化TIM8的三路互补PWM（前三个通道）和一路PWM（通道4）*/
			#define STSTEM_TIM8PWM_useBreak	1		/*是否启用BKIN刹车信号控制输入，默认低电平有效*/
													/*选择每一个通道的有效电平和空闲电平（可能是刹车时的电平），默认死区3us，可修改*/
			/*输出通道选择，共四个通道，可以相与打开多个通道，互补通道默认成对打开*/
			#define STSTEM_TIM8PWM_CHANNEL_ENABLE (B0000_0001|B0000_0010|B0000_0100|B0000_1000)		/*必须加括号括起来*/
			#define tim8arr 		STSTEM_TIM8_Period_10K	/*选择定时器1输出频率（预分频系数为72，这里选择重装值）*/
				#define STSTEM_TIM8_Period_1K	(1000-1)
				#define STSTEM_TIM8_Period_2K	(500-1)
				#define STSTEM_TIM8_Period_5K	(200-1)
				#define STSTEM_TIM8_Period_10K	(100-1)
				#define STSTEM_TIM8_Period_20K	(50-1)
				#define STSTEM_TIM8_Period_50K	(20-1)
				#define STSTEM_TIM8_Period_100K	(10-1)
				#define STSTEM_TIM8_Period_200K	(5-1)
/*可用API：
		启动通道1~4的PWM输出
		HAL_TIM_PWM_Start(&TIM8_Handler,TIM_CHANNEL_1);
		
		启动互补通道1~3的PWM输出
		HAL_TIMEx_PWMN_Start(&TIM8_Handler,TIM_CHANNEL_1);
		
		关闭通道的PWM输出（通道选择同上）
		HAL_TIM_PWM_Stop(&TIM8_Handler,TIM_CHANNEL_1);
		HAL_TIMEx_PWMN_Stop(&TIM8_Handler,TIM_CHANNEL_1);
		
		设置TIM1的PWM通道2的占空比百分数为88.8%，值需在0~100.0之间。即88.8%的低电平时间（本模板规范：低电平有效，即用电器工作电压）
		TIM8_set_Channel_Pulse(TIM8PWM_Channel_2,88.8);
*/		
		

/*通过用定时器2：16位，四个独立通道可用于：输入捕获、输入比较、PWM、单脉冲，多种途径触发DMA中断*/
#define STSTEM_TIM2_ENABLE		0			/*通用定时器2，功能自定，默认分频系数为72，初始化函数在PeriphCconfig.c里面定义*/
	#define STSTEM_TIM2_TI_ENABLE	1		/*是否开启定时器2的定时中断*/
	
	#define STSTEM_TIM2_asPWMorCap	3		/*选择定时器2作为...注：PWM(输出比较)、输入捕获和正交解码三个功能不能共用！*/
											/*写3作为正交编码器的解码使用，只能使用CH1和CH2，即PA15和PB3，默认使用两路边沿触发，计数值为单路上升沿数的四倍
												正交解码使用到TIM2的定时中断，必须打开！但在初始化时已经默认打开*/
											/*写2作为普通定时器中断使用*/
											/*写1作为输入捕获：可以获取高电平或者低电平的时间，默认不分频，不滤波
												输入捕获使用到TIM2的定时中断，必须打开！但在初始化时已经默认打开*/
											/*写0作为PWM：默认PWM1模式，向上计数，低电平有效，一个周期内占空比越大低电平时间越长
												引脚说明：			没有重映射			两种部分重映射			完全重映射
												TIM2四个通道：		PA0 PA1 PA2 PA3		含有前面的引脚		PA15 PB3 PB10 PB11
												注意：由于PA2 PA3串口2占用，PA0 PA1由ADC占用，所以TIM2的PWM只用完全重映射！！
														但PB10 PB11串口3占用，要么不用串口3，要么串口3重映射
												初始化后自动打开相应通道的PWM输出
											*/
			/*PWM输出比较功能选项*/
			#define tim2arr STSTEM_TIM2PWM_Period_5K			/*选择定时器输出频率（预分频系数为72，这里选择重装值）*/
				#define STSTEM_TIM2PWM_Period_1K	(1000-1)	/*注意：这里是选择重装值，也是占空比的分辨率，频率高则分辨率低，反之亦然，慎选*/
				#define STSTEM_TIM2PWM_Period_2K	(500-1)
				#define STSTEM_TIM2PWM_Period_5K	(200-1)
				#define STSTEM_TIM2PWM_Period_10K	(100-1)
				#define STSTEM_TIM2PWM_Period_20K	(50-1)
				#define STSTEM_TIM2PWM_Period_50K	(20-1)
				#define STSTEM_TIM2PWM_Period_100K	(10-1)
				#define STSTEM_TIM2PWM_Period_200K	(5-1)
			#define STSTEM_TIM2PWM_CHANNEL_ENABLE	B0000_0001|B0000_0010 /*输出通道选择，共四个通道，可以相与打开多个通道，PA15 PB3 PB10 PB11*/
			/*可用API：
				HAL_TIM_PWM_Start(&TIM2_Handler,TIM_CHANNEL_2);		开启TIM2的PWM通道2
				HAL_TIM_PWM_Stop(&TIM2_Handler,TIM_CHANNEL_2);		关闭TIM2的PWM通道2，但看源码好像使所有通道都关闭了，待实验
				
				设置TIM2的PWM通道2的占空比百分数为88.8%，值需在0~100.0之间。即88.8%的低电平时间（本模板规范：低电平有效，即用电器工作电压）
				TIM2_set_Channel_Pulse(TIM2PWM_Channel_2,88.8);
			*/
			
			/*输入捕获功能选项*/
			#define STSTEM_TIM2_Cap_trigV	1			/*写1高电平触发一次输入捕获，写0相反，写2双边沿触发*/
			#define STSTEM_TIM2_Cap_Channel	B0000_0001	/*选择用哪个通道当输入捕获，只能四选一！！*/
			/*可用API：
				float Peek_TIM2_Cap_Val();		获取最近一次TIM2输入捕获的脉冲时间，单位 毫秒，按照设置的捕获沿进行，可以随时随地调用此函数
			*/
			
			/*正交解码功能选项*/
			// 4 : 			使用定时器编码器接口捕获AB相的上升沿和下降沿，一个脉冲*4
			// ENCODER：	编码器线数(转速一圈输出脉冲数)
			// SPEEDRATIO：	电机减数比，内部电机转动圈数与电机输出轴转动圈数比，即减速齿轮比，编码器一般和电机转速一致，即直接把编码器安装到电机轴上！
			#define ENCODER     300    	// 编码器线数
			#define SPEEDRATIO  1   	// 电机减速比
			#define PPR         (SPEEDRATIO*ENCODER*4) // Pulse/r 每圈可捕获的脉冲数，不用动！
			/*可用API：
				得到当前计数值：int32_t peek_TIM2_Encoder_Value(void); //用于表示编码器当前的绝对位置
				速度：只需去定时器溢出中断函数HAL_TIM_PeriodElapsedCallback的TIM4中用一个速度变量接着 peek_TIM2_Encoder_Speed()返回的速度值 单位 转/秒
			*/

/*hd系列外设，基本定时器6、7，只能用于定时中断，提供更多的同步功能*/
#define STSTEM_TIM6_ENABLE		0
	#define tim6arr STSTEM_TIM6_Period_5K			/*选择定时器6输出频率（预分频系数为72，这里选择重装值）*/
		#define STSTEM_TIM6_Period_1K	(1000-1)
		#define STSTEM_TIM6_Period_2K	(500-1)
		#define STSTEM_TIM6_Period_5K	(200-1)
		#define STSTEM_TIM6_Period_10K	(100-1)
		#define STSTEM_TIM6_Period_20K	(50-1)
		#define STSTEM_TIM6_Period_50K	(20-1)
		#define STSTEM_TIM6_Period_100K	(10-1)
		#define STSTEM_TIM6_Period_200K	(5-1)
#define STSTEM_TIM7_ENABLE		0
	#define tim7arr STSTEM_TIM6_Period_5K			/*选择定时器7输出频率（预分频系数为72，这里选择重装值）*/
		#define STSTEM_TIM7_Period_1K	(1000-1)
		#define STSTEM_TIM7_Period_2K	(500-1)
		#define STSTEM_TIM7_Period_5K	(200-1)
		#define STSTEM_TIM7_Period_10K	(100-1)
		#define STSTEM_TIM7_Period_20K	(50-1)
		#define STSTEM_TIM7_Period_50K	(20-1)
		#define STSTEM_TIM7_Period_100K	(10-1)
		#define STSTEM_TIM7_Period_200K	(5-1)
/*
	关闭定时中断：（先清除中断标志位，再关闭中断）
		__HAL_TIM_CLEAR_IT(&TIM6_Handler, TIM_IT_UPDATE);
		HAL_TIM_Base_Stop_IT(&TIM6_Handler);
		
		__HAL_TIM_CLEAR_IT(&TIM76_Handler, TIM_IT_UPDATE);
		HAL_TIM_Base_Stop_IT(&TIM7_Handler);
		
		注： __HAL_TIM_CLEAR_FLAG(&TIM6_Handler,TIM_FLAG_UPDATE);和
			 __HAL_TIM_CLEAR_IT(&TIM6_Handler, TIM_IT_UPDATE);效果应该一样
*/


/*
	ADC：STN32的是12位逐次逼近型，分ADC1、2和3，其中ADC1和ADC2的引脚一样（除了内部通道）；
	最大速率1MHz，1us（在AD时钟14MHz（最高），采样时间为1.5个周期得到），总转换时间为 (采样时间 + 12.5个周期)，采样时间长则采样精度高；
	参考电压 Vref-必须连到VSSA，Vref+可连到 2.4V~VDDA，ADC输入电压必须小于Vref+，默认Vref+为3.3V，否则自行更改转换计算
	ADC1本质就是一个AD转换器加16路选择器，所以ADC1同一时刻采样值只能是一个，如果用在规则组中扫描模式，无法得知当前结果是哪一路的，一个AD模块一个值
	ADC1的通道与引脚映射：
	通道：	0	1	2	3	4	5	6	7	8	9	10	11	12	13	14	15	   16		     17
	IO	：	A0	A1	A2	A3	A4	A5	A6	A7	B0	B1	C0	C1	C2	C3	C4	C5	内部温度	内部参考电压
*/
#define SYSTEM_ADC1_ENABLE		0			/*启否ADC1*/
	#define SYSTEM_ADC1_useScan		1		/*启否规则组的连续扫描，如果启用，则把下面定义的所有通道都放到规则组里，并使用DAM1的通道1把转换结果放到目标位置
												如果不启用，则为软件触发的单次转换*/
		#define SYSTEM_ADC1_useCircular	1	/*只在扫描模式下有效；开启则自动循环ADC转换，只需要判断标志位和读数即可，不需要软件手动触发开启一次ADC转换*/
	#define SYSTEM_ADC1_useChanlNum	3		/*定义共用多少路通道*/
	#define SYSTEM_ADC1_useChanl	B1in16|B4in16|B5in16 /*定义共用哪些通道，可写B1in16~B15in16（分别代表通道0~14），和InrTemp(内部温度通道)
														（第16个ADC1通道留作内部温度标志所以不可用）*/
													/*如果只用采集内部温度，而不用其他通道，应设置：SYSTEM_ADC1_useChanlNum为1  SYSTEM_ADC1_useChanl单为InrTemp*/
		#define InrTemp B16in16
		extern u16 adValue[SYSTEM_ADC1_useChanlNum];/*扫描模式下DMA1把ADC转换结果传送的目标位置*/
		extern u8 adValueDone; 						/*扫描模式下转换完成标志*/
	/*可用的API：返回的都是原始ADC值
			凡是启用 SYSTEM_ADC1_useScan 扫描模式，即触发一次，自动扫描所有规则组里的通道————适合快速
						自动用DMA1通道1发送到adValue[]，并置位adValueDone
				读取顺序：
					调用 HAL_ADC_Start_DMA(&ADC1_Handler, (uint32_t*)&adValue,SYSTEM_ADC1_useChanlNum); 一次则开启一次规则组全部通道的转换
						调用1次则把规则组所有通道转换一遍，然后判断标志位adValueDone等着在adValue[]取数就行了
					如果 SYSTEM_ADC1_useCircular 打开：只需要执行一次！一次！ HAL_ADC_Start_DMA(&ADC1_Handler, (uint32_t*)&adValue,SYSTEM_ADC1_useChanlNum); 即可
					
